import React from "react";

import "./PrivacyPage.scss";
import Header from "../../component/Header";


function PrivacyPage() {
  return (
    <div className="privacy-page">
      <Header />
      <div className="privacy-page__content">
        <div className="privacy-page__header">Политика конфиденциальности</div>
        <div className="privacy-page__text">
          <div className="privacy-page__text-bold">
            Настоящая Политика конфиденциальности распространяется на
            информацию, которую мы собираем о вас, когда вы используете наше
            приложение.
          </div>
          <div className="privacy-page__text-bold">
            {" "}
            Информация, которую вы нам предоставляете
          </div>
          <div>
            {" "}
            Мы собираем информацию о вас, когда вы вводите ее при регистрации
            или иным образом предоставляете ее нам.
          </div>
          <div>
            {" "}
            Информация об учетной записи и профиле: мы собираем информацию о
            вас, когда вы регистрируете учетную запись, создаете или изменяете
            свой профиль, устанавливаете предпочтения или регистрируетесь. У вас
            также есть возможность добавить отображаемое имя, фото профиля,
            должность и другие данные в информацию вашего профиля, которая будет
            отображаться в нашем приложении.
          </div>
          <div>
            В целях безопасности : мы используем информацию о вас и вашем
            использовании приложения для проверки учетных записей и действий,
            для обнаружения, предотвращения и реагирования на потенциальные или
            фактические инциденты безопасности, а также для мониторинга и защиты
            от других злонамеренных, вводящих в заблуждение, мошеннических или
            незаконных действий.
          </div>
          <div className="privacy-page__text-bold">
            Как долго мы храним информацию
          </div>
          <div>
            Как долго мы храним информацию о вас, которую мы собираем, зависит
            от типа информации, как более подробно описано ниже. По истечении
            этого времени мы либо удалим, либо деидентифицируем вашу информацию,
            или, если это невозможно (например, потому что информация была
            сохранена в резервных архивах), мы будем надежно хранить вашу
            информацию и изолировать ее от любого дальнейшего использования. до
            тех пор, пока удаление не станет возможным.
          </div>
          <div>
            Информация об учетной записи : мы храним информацию о вашей учетной
            записи, пока она активна, и в течение разумного периода после этого,
            если вы решите повторно активировать Услуги. Мы также сохраняем
            некоторую вашу информацию по мере необходимости для соблюдения наших
            юридических обязательств, разрешения споров, обеспечения соблюдения
            наших соглашений, поддержки деловых операций и продолжения развития
            и улучшения наших Услуг. В тех случаях, когда мы сохраняем
            информацию для улучшения и развития приложения, мы предпринимаем
            шаги для удаления информации, которая непосредственно идентифицирует
            вас, и мы используем эту информацию только для раскрытия
            коллективного понимания использования наших Сервисов, а не для
            конкретного анализа ваших личных характеристик.
          </div>
          <div> Ваш выбор :</div>
          <div>
            Вы имеете право запросить копию своей информации, возразить против
            использования нами вашей информации, запросить удаление или
            ограничение вашей информации или запросить вашу информацию в
            структурированном электронном формате. Ниже мы описываем инструменты
            и процессы для выполнения этих запросов. Вы можете воспользоваться
            некоторыми вариантами, войдя в приложение и используя настройки,
            доступные в приложении или в вашей учетной записи.
          </div>
          <div>
            Ваш запрос и выбор могут быть ограничены в определенных случаях:
            например, если выполнение вашего запроса приведет к раскрытию
            информации о другом человеке или если вы попросите удалить
            информацию, которую мы или ваш администратор можем хранить по закону
            или имеем законные законные интересы. Если вы попросили нас
            поделиться данными с третьими сторонами, например, установив
            сторонние приложения, вам нужно будет напрямую связаться с этими
            сторонними поставщиками услуг, чтобы удалить вашу информацию или
            иным образом ограничить ее. Если у вас есть нерешенные проблемы, вы
            можете иметь право подать жалобу в орган по защите данных в стране,
            где вы живете, где вы работаете или где, по вашему мнению, ваши
            права были нарушены.
          </div>
          <div>
            Деактивируйте свою учетную запись : если вы больше не хотите
            использовать наше приложение, вы или ваш администратор можете
            деактивировать свою учетную запись в приложении. Если вы можете
            деактивировать свою учетную запись, эта настройка будет доступна вам
            в настройках вашей учетной записи. Имейте в виду, что деактивация
            вашей учетной записи не удаляет вашу информацию; ваша информация
            остается видимой для других пользователей приложения на основании
            вашего прошлого участия в приложении. Для получения дополнительной
            информации о том, как удалить вашу информацию, см. Ниже.
          </div>
          <div>
            Удалите вашу информацию : наше приложение дает вам возможность
            удалить определенную информацию о вас из приложения. Например, вы
            можете удалить контент, содержащий информацию о вас, с помощью
            инструментов поиска и редактирования по ключевым словам, связанных с
            этим контентом, а также вы можете удалить определенную информацию
            профиля в настройках вашего профиля. Однако обратите внимание, что
            нам может потребоваться сохранить определенную информацию для целей
            ведения учета, для завершения транзакций или для соблюдения наших
            юридических обязательств.
          </div>
        </div>
      </div>
    </div>
  );
}

export default PrivacyPage;
